[
  {
    "word": "42",
    "definition": "The answer to the Ultimate Question of Life, the Universe, and Everything."
  },
  {
    "word": "AJAX",
    "definition": "Short for Asynchronous JavaScript and XML; a JavaScript technology used by a web page to request information from a web server without loading a new page."
  },
  {
    "word": "Algorithm",
    "definition": "A sequence of instructions or a set of rules that are followed to solve a task."
  },
  {
    "word": "AngularJS",
    "definition": "A JavaScript-based open source front-end web application framework used for creating rich, extensible web applications."
  },
  {
    "word": "API",
    "definition": "Short for Application Programming Interface; A set of functions and procedures that allow the creation of applications which access the features or data of an operating system, application, or other service."
  },
  {
    "word": "Asynchronous",
    "definition": "(a program part) Executed simultaneously or indepentently from the main or current thread or process."
  },
  {
    "word": "Back-end",
    "definition": "Sometimes referred to as 'server-side', this refers to what a user can't see like databases or servers. It organises and stores data."
  },
  {
    "word": "BEM",
    "definition": "Acronym for block, element, modifier. BEM is a strict writing CSS rules. With BEM you will write some like this: '.block-element--modifier'. E.g., 'menu-item--active'"
  },
  {
    "word": "BIOS (Basic Input/Output System)",
    "definition": "Firmware that coordinates how the software interacts with the hardware."
  },
  {
    "word": "Bit",
    "definition": "In computing, a bit (short for binary digit) is the smallest unit of measurement for information. A bit is represented as either 1 or 0. Eight bits make up one byte."
  },
  {
    "word": "Buffer",
    "definition": "A data buffer (or just buffer) is a region of a physical memory storage used to temporarily store data while it is being moved from one place to another."
  },
  {
    "word": "Buffer overflow",
    "definition": "In information security and programming, a buffer overflow, or buffer overrun, is an anomaly where a program, while writing data to a buffer, overruns the buffer's boundary and overwrites adjacent memory locations."
  },
  {
    "word": "Bug",
    "definition": "An error or flaw in a website or program that keeps it from running as expected. There are three types of bugs: syntax errors, when there is an error in the source code; runtime errors, when the source code is legal but there is an error while running; and logic errors, where the program runs without errors but doesn't do what is intended."
  },
  {
    "word": "C#",
    "definition": "Pronounced 'C-Sharp' - A general-purpose object-oriented programming language developed by Microsoft."
  },
  {
    "word": "Cache",
    "definition": "Stored information. When you download (visit) a web page, the data is 'cached', meaning it is temporarily stored on your computer. The next time you want that page, instead of requesting the file from the web server, your web browser just accesses it from the cache, so the page loads quickly. The downside to this is that if the cached web page is often updated, you may miss the latest version. If you suspect that the web page you're seeing is not the latest version, use the 'refresh' button on your browser or find a menu option to \"clear caches.\""
  },
  {
    "word": "Callback",
    "definition": "A callback function is a function that is passed as an argument to other code that is expected to call back the argument at a given time. If this is immediate then it called synchronous callback; if it is delayed it is called asynchronous callback."
  },
  {
    "word": "camelCase",
    "definition": "A formatting style for a group of words, frequently used in programming.  For example 'camelCase', 'alsoCamelCase', and 'oneMoreExampleOfCamelCase'. Not to be confused with Pascal Case (or UpperCamelCase), which is almost exactly the same; however it capitalizes the first word in the group as well (i.e. 'ThisIsPascalCase')."
  },
  {
    "word": "Cloud",
    "definition": "A general term for remote servers used or accessed through the internet."
  }, 
  {
    "word": "Cloud Computing",
    "definition": "Cloud computing is the the use of various services, such as software development platforms, servers, storage and software, over the internet."
  },
  {
    "word": "CMS (content management system)",
    "definition": "A software application or set of related programs that are used to create and manage digital content. It typically supports multiple users in a collaborative environment."
  },
  {
    "word": "Column family",
    "definition": "A database object that contains columns of related data."
  },
  {
    "word": "Command-line",
    "definition": "(also \"Command prompt\", \"Terminal\") A basic form of computer I/O where commands are typed and entered through a text-based interface."
  },
  {
    "word": "Compile",
    "definition": "Translate source code files into binary, machine-code files. In Java, source code files are compiled into intermediate bytecode that is executed by a virtual machine."
  },
  {
    "word": "Continuous Delivery (CD)",
    "definition": "CD is a software engineering approach in which teams produce software in short cycles, ensuring that the software can be reliably released at any time and, when releasing software, doing so manually. The goal is to build, test and release software with greater speed and frequency."
  },
  {
    "word": "Continuous Integration (CI)",
    "definition": "CI is a development practice that requires developers to integrate code into a shared repository several times a day. Each check-in is then verified by an automated build, allowing teams to detect problems early."
  },
  {
    "word": "CORS (Cross-origin resource sharing)",
    "definition": "A mechanism that allows web applications to access resources from different origin."
  },
  {
    "word": "CSS (Cascading Style Sheets)",
    "definition": "A style sheet language used for describing the look (e.g. colors, sizes, spacing, etc) of an HTML document."
  },
  {
    "word": "CSV (comma-separated values)",
    "definition": "A file format which allows data to be saved in a tabular format."
  },
  {
    "word": "Database",
    "definition": "An organized collection of data. More specifically,  an electronic system that allows data to be easily accessed, manipulated and updated."
  },
  {
    "word": "Data Science",
    "definition": "Data science is an interdisciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from data in various forms, both structured and unstructured, similar to data mining."
  },
  {
    "word": "DBMS",
    "definition": "Database management system. Examples include: Oracle, MySQL, MSSQL, DB2, and some nosql varieties."
  },
  {
    "word": "DDD (Domain-driven design)",
    "definition": "An approach to software development for complex needs by connecting the implementation to an evolving model. The premise of domain-driven design is: <ul class='browser-default'><li>placing the project's primary focus on the core domain and domain logic;</li><li>basing complex designs on a model of the domain;</li><li>initiating a creative collaboration between technical and domain experts to iteratively refine a conceptual model that addresses particular domain problems.</li></ul>"
  },
  {
    "word": "Debugging",
    "definition": "The process of locating and fixing or bypassing bugs (errors) in computer program code or the engineering of a hardware device."
  },
  {
    "word": "Dev",
    "definition": "Short for 'Developer.'"
  },
  {
    "word": "Developer",
    "definition": "A person or company that creates new products, especially computer products such as software."
  },
  {
    "word": "DNS (Domain Name System)",
    "definition": "A hierarchical, decentralized naming system for computers, services, or other resources connected to the Internet or a private network. It associates various information with domain names assigned to each of the participating entities."
  },
  {
    "word": "DOM (The Document Object Model)",
    "definition": "A programming interface for HTML and XML documents. It represents the page in a browser so that programs can change the document structure, style, and content. The DOM represents the document as nodes and objects."
  },
  {
    "word": "Esoteric Programming Language",
    "definition": "A programming language designed to push the boundaries of computer programming language design, as a proof of concept, as software art, or as a joke."
  },
  {
    "word": "Firmware",
    "definition": "Firmware is a general term for the various kinds of programs built into hardware. An example of firmware would be a BIOS."
  },
  {
    "word": "Flutter",
    "definition": "Flutter is an open-source mobile application development SDK created by Google. It is used to develop applications for Android and iOS."
  },
  {
    "word": "Front end",
    "definition": "What a user sees and interacts with on a website or app."
  },
  {
    "word": "FTP (File Transfer Protocol)",
    "definition": "A common method of transferring files via the internet from one computer to another."
  },
  {
    "word": "GIF (Graphics Interchange Format)",
    "definition": "A bitmap image format. Supports up to 8 bits per pixel for each image, allowing a single image to reference its own palette of up to 256 different colors chosen from the 24-bit RGB color space. It also supports animations and allows a separate palette of up to 256 colors for each frame."
  },
  {
    "word": "Go",
    "definition": "Go is an open source programming language, created at Google. You can use it to write back-end code for Mac, Windows and Linux that is highly performant. It is sometimes referred to as 'Golang' to make it easier to Google."
  },
  {
    "word": "GraphQL",
    "definition": "GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools."
  },
  {
    "word": "Gulp",
    "definition": "A task runner for JavaScript that allows you to automate a variety of time-consuming tasks."
  },
  {
    "word": "Hardware",
    "definition": "A physical computer system. Software is run using hardware."
  },
  {
    "word": "HEVC (High Efficiency Video Coding)",
    "definition": "Also known as H.265 and MPEG-H Part 2; a video compression standard, one of the potential successors of the H.264 AVC video format."
  },
  {
    "word": "High-level",
    "definition": "Abstracted away from the complicated details of hardware or implementation. Python is an example of a programming language that is relatively high-level. Opposite of \"Low-level.\""
  },
  {
    "word": "HTML (Hypertext Markup Language)",
    "definition": "A standardized system to structure text files to achieve font, color, graphic, and hyperlink effects on Web pages."
  },
  {
    "word": "HTTP (Hypertext Transfer Protocol)",
    "definition": "A transfer protocol mainly used for Web pages."
  },
  {
    "word": "IDE (Integrated Development Environment)",
    "definition": "An application that developers use for software development. IDEs provide features such as a source code editor, debugger, and intelligent code completion."
  },
  {
    "word": "I/O",
    "definition": "Input and output."
  },
  {
    "word": "Java",
    "definition": "A general-purpose object-oriented programming language, created by Sun Microsystems."
  },
  {
    "word": "JavaScript",
    "definition": "A separate language from Java; an object-oriented programming language which is most commonly used alongside HTML and CSS for creating websites and web-based apps."
  },
  {
    "word": "JPEG (Joint Photographic Experts Group)",
    "definition": "The committee that created the file format known as JPEG. The format is commonly used for photos displayed on the world wide web."
  },
  {
    "word": "LAN (Local Area Network)",
    "definition": "A network that connects computers within a limited geographical area such as a home or office building."
  },
  {
    "word": "LESS",
    "definition": "Leaner Style Sheets - style sheet language that can be transpiled into CSS. The filename extention is .less. (Alternative definition) One UNIX paginator program."
  },
  {
    "word": "Library",
    "definition": "A library is a collection of software that a program can use. Libraries are particularly useful for storing frequently used algorithms because you do not need to type them out for every program that uses them."
  },
  {
    "word": "Linux",
    "definition": "Linux is an operating system, based on UNIX, that is open source and is used by many developers. Its various distributions include Debian, Ubuntu (based on Debian), Fedora, and Arch Linux."
  },
  {
    "word": "Low-level",
    "definition": "Dealing with complicated details of hardware or implementation. C is an example of a programming language that is relatively low-level. Opposite of \"High-level\""
  },
  {
    "word": "Machine Learning",
    "definition": "An application of artificial intelligence (AI) that provides systems the ability to automatically learn and improve from experience without being explicitly programmed."
  },
  {
    "word": "macOS",
    "definition": "An operating system, based on a version of UNIX, that is developed by Apple for its computers. iOS (the iPhone/iPad OS) is a derivative/"
  },
  {
    "word": "MERN",
    "definition": "Acronym that stands for the specific technology combination of MongoDB, Express, React, and Node.js."
  },
  {
    "word": "Microsoft Windows",
    "definition": "<del>A waste of money.</del> A commercial operating system developed by Microsoft."
  },
  {
    "word": ".NET",
    "definition": "Pronounced: 'dot net' - An perating system platform (or framework) developed by Microsoft."
  },
  {
    "word": "Network",
    "definition": "A group of computers connected to share services and information. The Internet is sometimes called a \"network of networks.\""
  },
  {
    "word": "Nginx",
    "definition": "Nginx (pronounced EN-jin-EKS) is a web server which can also be used as a reverse proxy, load balancer, mail proxy and HTTP cache."
  },
  {
    "word": "NLP (Natural Language Processing)",
    "definition": "The use of machine learning or AI techniques to proccess and produce human language."
  },
  {
    "word": "Node.js",
    "definition": "(sometimes just Node) A JavaScript runtime based on Chrome's V8 JavaScript engine. It allows you to write back-end code and scripts to do various tasks. It is the 'N' in 'MERN'."
  },
  {
    "word": "NPM",
    "definition": "NPM is the Node.js Package Manager and is installed alongside Node.js. Similar to NuGet for C# or Pip for Python, it lets you manage third-party dependencies in your project and keep track of which versions you have installed. Also see Yarn, an alternative to NPM."
  },
  {
    "word": "Object",
    "definition": "A value stored in memory with various properties and behaviors that can be referenced by an identifier."
  },
  {
    "word": "Object-oriented (OO)",
    "definition": "A type of programming organized around classes (or prototypes) and objects."
  },
  {
    "word": "OOCSS (Object Oriented CSS)",
    "definition": "A way to write CSS proposed by web developer Nicole Sullivan in 2008. Her goal was to make dynamic CSS more manageable by applying the principles of object oriented design to CSS."
  },
  {
    "word": "Open Source",
    "definition": "Software for which the original source code is made freely available and may be redistributed and modified."
  },
  {
    "word": "ORM (Object-Relational Mapping)",
    "definition": "A mechanism to link classes of an object-oriented (OO) programming language to tables of a relational database management system (RDBMS)."
  },
  {
    "word": "OS (Operating System)",
    "definition": "The software on a computer that manages resources and high-level I/O. Examples of operating systems are macOS, Linux, UNIX, and Microsoft Windows."
  },
  {
    "word": "Paginator",
    "definition": "A command-line program used to divide output into virtual pages for easier reading."
  },
  {
    "word": "PHP (PHP: Hypertext Preprocessor)",
    "definition": "PHP is a popular general-purpose scripting language that is especially suited to web development."
  },
  {
    "word": "PNG (Portable Network Graphics)",
    "definition": ". A raster graphics format with lossless data compression. PNG was created as a replacement for the patented Graphics Interchange Format (GIF)."
  },
  {
    "word": "Process",
    "definition": "A running computer program."
  },
  {
    "word": "Programming Language",
    "definition": "A programming language is a type of written language that is used to provide instructions to a computer. Examples of programming languages include C, C#, C++, Java, Ruby, Python, and Go."
  },
  {
    "word": "PWA (Progressive Web Apps)",
    "definition": "Web applications that load like regular web pages or websites but can offer the user functionality such as working offline, push notifications, and device hardware access traditionally available only to native mobile applications."
  },
  {
    "word": "Python",
    "definition": "Python is an interpreted high-level programming language for general-purpose programming."
  },
  {
    "word": "React",
    "definition": "A JavaScript library for building user interfaces."
  },
  {
    "word": "Responsive Design",
    "definition": "An adjective for websites that change to the size of the screen on which they're being viewed."
  },
  {
    "word": "REST API",
    "definition": "API that uses HTTP requests to GET, PUT, POST and DELETE data. REST API is based on representational state transfer (REST) technology, an architectual style and approach to communications, often used in web services development."
  },
  {
    "word": "SASS (Syntactically Awesome Style Sheets)",
    "definition": "A style sheet language that can be transpiled into CSS. Filename extension is .scss"
  },
  {
    "word": "Scala",
    "definition": "Scala is a general-purpose programming language providing support for functional programming and a strong static type system."
  },
  {
    "word": "SEO (Search Engine Optimization)",
    "definition": "The method of gaining traffic (users) to your website through search engines like Google, Bing etc. by ranking on the first page for particular keywords."
  },
  {
    "word": "Server",
    "definition": "A server is a computer program or a device that provides functionality for other programs or devices, called 'clients'. This architecture is called the client–server model, where a single overall computation is distributed across multiple processes or devices."
  },
  {
    "word": "SDK (Software Development Kit)",
    "definition": "A collection of libraries, tools or programs used by devlopers."
  },
  {
    "word": "Software",
    "definition": "Software is a general term for the programs used in computers and related devices. Different from \"Hardware.\""
  },
  {
    "word": "Source Code",
    "definition": "The collection of files containing instructions in a programming language that make up a program. Source code is commonly compiled into a binary executable format. It may also be run by an interpreter if it is an interpreted language such as Python or Ruby."
  },
    {
    "word": "SQL (Structured Query Language)",
    "definition": "A standard computer language for relational database management and data manipulation."
  },
  {
    "word": "SSL (Secure Sockets Layer)",
    "definition": "The security protocol that allows for transmission of encrypted data between a web server and a user's browser."
  },
  {
    "word": "Synchronous",
    "definition": "(a program part) Executed in the same thread or process. Opposite of \"Asynchronous.\""
  },
  {
    "word": "TDD (Test Driven Development)",
    "definition": "A software development process that relies on the repetition of a very short development cycle: <ul class='browser-default'><li>Add a test (initialy failing)</li><li>Run all tests and see if the new one fails</li><li>Write some code</li><li>Run tests</li><li>Refactor code</li><li>Repeat</li></ul>"
  },
  {
    "word": "Thread",
    "definition": "A thread is a unit of execution; i. e., a program or part of a program that a computer can execute concurrently with others. A thread is a process, or part of it. (Alternative definition) A thread of discussion in an online forum."
  },
  {
    "word": "TLD (Top Level Domain)",
    "definition": "A domain at the highest level in the hierarchical Domain Name System of the Internet (e.g., .com, .net, .org)."
  },
  {
    "word": "TLS (Transport Layer Security)",
    "definition": "A cryptographic protocol designed to provide communications security over a computer network. It succeeds SSL."
  },
  {
    "word": "Transaction",
    "definition": "An atomic unit of work that should either be completed in its entirety or not done at all."
  },
  {
    "word": "Transpile",
    "definition": "The same as compiling, except that source code is translated into another form of source code, and not into binary/machine code."
  },
  {
    "word": "TypeScript",
    "definition": "An open-source programming language developed and maintained by Microsoft. It is a strict syntactical superset of JavaScript and adds optional static typing to the language. TypeScript transpiles into JavaScript."
  },
  {
    "word": "UAT (User Acceptance Testing)",
    "definition": "Formal testing done often by the user, with respect to user needs, requirements, and business processes conducted to determine whether or not a system satisfies the acceptance criteria and to enable the user to determine whether or not to accept the system."
  },
  {
    "word": "UNIX",
    "definition": "UNIX is an operating system developed in the 1970s. Linux is a derivative."
  },
  {
    "word": "Variable",
    "definition": "A variable is a value that can change, depending on the logic of, conditions in, or information passed through the program."
  },
  {
    "word": "WAN (Wide Area Network)",
    "definition": "Any network geographically wider than a LAN (Local Area Network). The Internet is a WAN."
  },
  {
    "word": "WebAssembly (Wasm, WA)",
    "definition": "WebAssembly is a Web standard that defines a binary format and a corresponding assembly-like text format for executable code in Web pages. It is meant to enable executing code nearly as fast as running native machine code."
  },
  {
    "word": "Web Browser",
    "definition": "A software program that allows you to surf the web. Popular web browsers include Google Chrome, Mozilla Firefox, and Microsoft Edge and Internet Explorer."
  },
  {
    "word": "Web Worker",
    "definition": "A JavaScript script executed from an HTML page that runs in the background, independently of user-interface scripts that may also have been executed from the same HTML page."
  },
  {
    "word": "WWW (World Wide Web)",
    "definition": "An information space where documents and other web resources are identified by URLs, interlinked by hypertext links and accessible via the Internet."
  },
  {
    "word": "Yarn",
    "definition": "An alternative to NPM (Node.js Package Manager) developed by Facebook. It is generally considered to be faster and more secure than NPM, although they are mostly interchangeable."
  }
]
